{
    "data": [
        {
            "id": "1",
            "title": "Model for Fraud Management and Deterrence: A Test of the Behavioural Theory of Fraud. (Okafor Benedict Ebubedike, 2003407004P, 2008). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "2",
            "title": "Accounting Information in Productivity and Strategic Decision Making. A Study of Selected Manufacturing Firms in Nigeria. (Odum Augustine, 2003407001P,  2008). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "3",
            "title": "Investigation into Audit Client Management Pressure: A Study of Audit Dispute Resolution Strategies in Nigeria. (Aroh Joseph. Chike, 2001407002P, . 2010). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "4",
            "title": "Impact of Public Sector Budgeting Reforms on Selected Macro Economic Indicators in Nigeria. [1979 – 2008] (Ubaka C. Eugene, 2001407001P,  2010) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "5",
            "title": "A Model for Implementation of Fair Value Accounting in Corporate Financial Report. (Ijoma, Ngozi B, 2003407005P,  2011) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "6",
            "title": "Impact of Management Accounting Information on Outsourcing Decision Making. A Study of Selected Nigeria Public Sector Organizations  (Ofoegbu Grace,  2003407002P, 2011) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "7",
            "title": "Degree of Compliance with the Requirements of Information to be Disclosed in Financial Statements: A Study of Quoted Firms in Nigeria. (Ezugwu Christian I, 2006407006P,  2011) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "8",
            "title": "Strategic Management Accounting and Competitive Advantage in the Manufacturing Industry: A Study of Selected Manufacturing Firms in Nig. (Akenbor Cletus O. 2007407012F,  2011). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "9",
            "title": "Corporate Environmental Accounting Practices in Nigeria: A Study of Selected Quoted Manufacturing Firms. (Okafor Gloria O. 2004407003P, 2011) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "10",
            "title": "Application of Human Resource Accounting as a Tool in Private Sector Management: A Study of Selected Establishments in Nig. (Akamobi Ndidika Livinus, 2004407004P  2011). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "11",
            "title": "Modeling for Fraud Detection in Financial Statements: A Study of Selected Banks in Nigeria. (Egbunike Patrick, 2005407007P,  2011). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "12",
            "title": "Efficacy of Cost Based Decisions in Capacity Cost Planning by Manufacturing Companies in Nigeria. (Emengini Emeka, 2005407003P,  2013). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "13",
            "title": "Corporate Financial Reporting and Accounting for Marketable Securities. A study of Recapitalized Banks in Nigeria. (Oghoghomeh Tennyson, 2006407004P,  2013). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "14",
            "title": "Application of Human Resource Accounting (HRA) to Public Sector Resource Management in Nigeria. A Study of Selected Organizations.  (Udeh Francis N.P, 2005407003P, 2013). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "15",
            "title": "Department of Accountancy, “Forensic Accounting Skill and Techniques in Fraud Investigation in Nigerian Public Sector”, Kogi State University, Anyingba  (Gbegi Daniel, 09PGAC8004, 2013)."
        },
        {
            "id": "16",
            "title": "Taxation as a tool for Economic Growth and Development: Nigerian Experience. (Nkwo, Nwitte-Eze Nnagozie, 2007407016P, 2014). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "17",
            "title": "Application of Fraud Diamond Model in the Determination of the Fraud Risk Factor in Banks in Nigeria.(Onodi, Benjamin Ezeugwu, 2007407004P,  2014). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "18",
            "title": "Impact of Human Resource Capital Disclosure on Goodwill Corporate   Organizations (Bingilar Paymaster, 2008151001, 2014). Chukwuemeka Odumegwu Ojukwu University Igbariam, Anambra State"
        },
        {
            "id": "19",
            "title": "Competitor focused Accounting and Financial Performance in Selected Listed Manufacturing Firms on Nigerian Stock Exchange (Chiekezie Njideka Rita, 2005407005P,  2014). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "20",
            "title": "Impact of Intellectual Capital on the Performance of Listed Firms on the Nigerian Stock Exchange. (Aroh Nkechi, 2006407014P, 2014). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "21",
            "title": "Effect of Mandatory Adoption of International Financial Reporting Standards on Accounting Quality: Evidence from Selected African Countries (Chukwu Gospel, 2007407001P,  2014). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "22",
            "title": "Changes in Global Financial Regulatory Framework: Implementation for Accounting Profession in Nigeria (Oraka Azubuike.O, 2006407007P, 2014). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "23",
            "title": "Stemming the Tide of Audit Failure in Nigeria: The Search for Audit Quality. (Okaro, Sunday. C, 2010407001P,  2015). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "24",
            "title": "Combating Fraud and White Collar Crimes through Application of International Accounting Reporting Standards: A Nigeria Field Study (Nenyiaba I.C, 2007407010P,  2016). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "25",
            "title": "Impact of Tax Reforms on Economic Development of Nigerian (1982-2012). (Omesi, Israel. 2007407007P,  2016). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "26",
            "title": "Effect of Intellectual Capital on Corporate Valuation of Selected Quoted Firms in Nigeria. (Onyekwelu, Uche. L. 2006407010P, 2016). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "27",
            "title": "Effect of Intellectual Capital on Firm’s Market value and Financial Performance of Selected Quoted Service Firms in Nigeria (2000-2014). (Amahalu, Nestor. N, 2011387016P, 2016). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "28",
            "title": "Impact of International Financial Reporting Standards on Financial Statements and Accounting and Accounting Qualities in Nigeria. (Avwokeni, Arthur J, 2011387001F,  2016). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "29",
            "title": "Effect of Capital Structure on Firm Profitability: Evidence from Nigerian Quoted Firms. (Umechukwu, Ann I, 2008151031, 2016). Chukwuemeka Odumegwu Ojukwu University, Igbariam, Anambra State"
        },
        {
            "id": "30",
            "title": "Effect of DeAngelo’s Earnings Management Model on the Value Relevance of   Accounting Information in Pre and Post IFRS Adoption in Nigeria. (Chukwuto, N. O, 2011151007, 2016). Chukwuemeka Odumegwu Ojukwu University Igbariam, Anambra State"
        },
        {
            "id": "31",
            "title": "Effect of Fraud Pentagon Model on Fraud Risk Assessment in Commercial Banks in Nigeria. (Egolum, Priscillia, 2006407009P,  2016). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "32",
            "title": "Value Relevance of Financial Accounting Information and Equity Valuation of Quoted Firms in Nigeria (Jeroh, Edirin, 2009407006P, 2016) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "33",
            "title": "Disposition and Momentum Effect on Equity Shares in Nigeria: The Mental Accounting and Prospect Theory Approach. (Onuorah, Joshua K.J, 2006407001P,  2017) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "34",
            "title": "Effect of Audit Market Concentration and Auditor’s Attributes on Audit Quality in Nigeria (Aggrey, Meshack, 2012407005F, 2017) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "35",
            "title": "Effects of Public procurement Act 2007 on Outsourcing Decisions of public Sector Organizations in Nigeria (Nwadighoha, Chinedu E, 2006407011F,  2017) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "36",
            "title": "Effect of Fair Value Measurement on the Performance of Listed Firms on Nigeria Stock Exchange (Amaefule, Leonard Ifeanyi, 2012407020F, 2017) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "37",
            "title": "Effect of Foreign Direct Investment on Economic Growth of Selected Sub-Sahara African Countries ( Ugwu, James Ike, 2012407004P, 2017) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "38",
            "title": "Assessment of Accounting Bases on Future Cash Flow Predictions: Evidence from Nigeria Quoted Firms (2005-2015) (Ebiaghan, Orits Frank, 2009407004F, 2017) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "39",
            "title": "Effect of Green Accounting Characteristics on Profit Performance of Selected Firms in Nigeria (Ebubechukwu, Jacinta Ogochukwu, 2011387009F, 2017) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "40",
            "title": "Assessment of the Effect of International Financial Reporting Standards Adoption on Financial Reporting of Nigerian Banks ( Inaya, Lucky Salubi, 2009407002F, 2018) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "41",
            "title": "Development of a Model for Effective Housing Budget Performance in Anambra State, Nigeria (Ugochukwu, Stanley Chukwudi, 2013287002P, 2018) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "42",
            "title": "Effect of Intellectual Capital on Firms Listed on Nigeria Stock Exchange Market (Ewereoke Vitalis. N, 2012407008F, 2018)  Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "43",
            "title": "Value Relevance of Accounting Information and Share Price: Evidence from Nigeria and South Africa. (Odugbo, Zakari Tairu, 2011387002P. 2018) Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "44",
            "title": "Momentum Effect of Tax Return on Economic Growth in Nigeria (2000-2016). (Audu, Friday, 2012407011F, 2018). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "45",
            "title": "Effect of International Financial Reporting Standards on Performance of Listed Deposit Money Banks In Nigeria (20017 – 2016) (Nwufo, Christopher Ifeanyichukwu, 2005407002F, 2019). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "46",
            "title": "Effect of Corporate Attributes on Voluntary Corporate Social Disclosure of selected Listed Manufacturing Firms on the Nigerian Stock Exchange (Adeniyi, Segun Idowu, 2015407007F, 2019). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "47",
            "title": "Evaluation of Financial Data Integrity of International Financial Reporting Practices in Nigeria (Nwoye, Ugochukwu John, 2013407017F. 2019). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "48",
            "title": "Effect of Cost of Conflict on Nigerian Economy (2000 – 2018) (Ewiwile, Stephen, 2007407005F, 2019). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "49",
            "title": "Effect of Corporate Diversification on Financial Performance of Firms Quoted on the Nigerian Stock Exchange, 2007 = 2017 (Ezenwafor, Emmanuel Chidubem, 2013407002F, 2019). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "50",
            "title": "Effect of Environmental Cost on Performance of Quoted Firms in Sub Saharan Africa, 2007 – 2016 (Nwaimo, Steve Chijioke, 2012407003F, 2019). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "51",
            "title": "Triple Bottom Line Accounting and Performance of Listed Manufacturing Firms in Nigeria (Onyali, Chidiebele Innocent, 2015407004P, 2019). Nnamdi Azikiwe University, Awka"
        },
        {
            "id": "52",
            "title": "Company Attributes and Non-financial Information Disclosure of Consumer and Industrial Goods Companies Listed on the Nigerian Stock Exchange, 2012 – 2017 (Eneh, Onyinye Maria, 2013407014P, 2019). Nnamdi Azikiwe University Awka, Anambra State;  Nigeria"
        },
        {
            "id": "53",
            "title": "Effect of Corporate Characteristics on Human Resources Disclosure of Some selected Manufacturing Firms in Nigeria, 2004 – 2017 (Okika, Elochukwu Christian, 2016407012F, 2019). Nnamdi Azikiwe University Awka, Anambra State;  Nigeria"
        },
        {
            "id": "54",
            "title": "Effect of Corporate Governance Characteristics on the Performance of selected Listed Firms in Nigeria (Imade, Osazee Graham, 2015407002F, 2019). Nnamdi Azikiwe University Awka, Anambra State. Nigeria"
        },
        {
            "id": "55",
            "title": "Tripple Bottom Line Accounting: Organisational Growth and Profitability of Listed Industrial Goods Firms in Nigeria ( Ezuworo-Obodoekwe, Charity Nkiru, 2013151014, 2019). Chukwuemeka Odumegwu Ojukwu University, Igbariam, Anambra State"
        },
        {
            "id": "56",
            "title": "Corporate Board and Classification Shifting of Earnings Management: An Analysis of Sub-Sahara African Countries (Orjinta, Hope Ifeoma, 2015151001, 2019) Chukwuemeka Odumegwu Ojukwu University, Igbariam, Anambra State"
        },
        {
            "id": "57",
            "title": "Balanced Score Card (BSC) and Firm Value: Across Country Analysis ( Odum, Chinwe Gloria, 2013151004, 2019) Chukwuemeka Odumegwu Ojukwu University, Igbariam, Anambra State"
        },
        {
            "id": "58",
            "title": "Effect of Executive Dynamics on Voluntary Intangible Assets Disclosure of Listed Firms in Nigeria and Ghana (Ozoanigbo, Chinedu Venatius, 2015151007, 2020) Chukwuemeka Odumegwu Ojukwu University, Igbariam, Anambra State"
        },
        {
            "id": "59",
            "title": "Financial Risk and Performance of Deposit Money Banks: Evidence from Nigeria and Ghana (Onyefulu, Deborah Iyinomen, 2015151015, 2020) Chukwuemeka Odumegwu Ojukwu University, Igbariam, Anambra State"
        }
    ]
}