{
    "data": [
        {
            "id": "1",
            "title": "Okoye, E. (1994), Human Resources Development. It's Place in Modern Banking  Industries, Nigerian Journal of Technical Vocation Development, Vol.111 No.2."
        },
        {
            "id": "2",
            "title": "Okoye, E. (1996), Empirical Study on Strategy for the Development of Small –  Scale Industries in Nigeria, Journal of the Management Sciences, Vol. 1 No. 1."
        },
        {
            "id": "3",
            "title": "Okoye, E. (1998), Application of Simplex Method to Accounting Decision  Making, Journal of the Management Sciences. Vol. 1 No.3."
        },
        {
            "id": "4",
            "title": "Okoye, E. (2000), Distress Signal in Selected Commercial Banks: Trend Analysis  of Published Financial Statements, Journal of the Management Sciences., Vol. 111 No.2, June. "
        },
        {
            "id": "5",
            "title": "Okoye, E. (2000), The Nigerian Debt Problem: Course Consequences and   Option. African Banking and Finance Review, Vol.1.No1, June."
        },
        {
            "id": "6",
            "title": "Okoye, E.  (2001), Management of Stress in a Depressed Economy, Journal of  the Management Sciences, Vol. 5. No 1, January."
        },
        {
            "id": "7",
            "title": "Okoye, E. (2003), Effects of Privatization and Commercialization Vis-A-Viz  Removal of Subsidy in the Nigerian Economy, Journal of Management Sciences, Vol.111, No3."
        },
        {
            "id": "8",
            "title": "Okoye, E. and Odum, A. (2004), Cost Reduction Schemes for Corporate   Profitability; Journal of Multi-Disciplinary Studies; Vol. 12 No. 1, September."
        },
        {
            "id": "9",
            "title": "Okoye, E.  and Nwokediuko, E. (2004), Securities Analysis on the Nigerian Stock  Exchange; A Comparative Study of Selected Equities, The Journal of   Association of National Accountants of Nigeria, Vol. 12 No. 4, July – December."
        },
        {
            "id": "10",
            "title": "Okoye, E. and Ubaka, E (2004), Capital Income and Value: An Inseparable Triplets in a Business Organization, Oko Journal of Business Studies, Vol. 3 No. 1, Onitsha Adson Education Publishers."
        },
        {
            "id": "11",
            "title": "Okoye, E. and Odum, A. (2004), Budgeting as a Management Tool for Improving Effectiveness of an Organization, Nigerian Journal of Research and Production, Vol. 3 No. 5, September.   "
        },
        {
            "id": "12",
            "title": "Okoye, E. and Odum, A. (2005), Relevance of Disclosures in Annual   Corporate Reporting to Investment Decisions: An Empirical Study, Journal of Multi-Disciplinary Studies. April "
        },
        {
            "id": "13",
            "title": "Okoye, E. (2005), Federalism and Revenue Allocation in Nigeria, Journal of  Multi-Disciplinary Studies. Vol. 13 No 1."
        },
        {
            "id": "14",
            "title": "Okoye, E. and Ubaka, E. (2005), Income: A Significant Tool for Investment of  Managerial Decision, Journal of Economics NAU. "
        },
        {
            "id": "15",
            "title": "Okoye, E. (2005), Managing Personal Conflicts as a Factor for Proper   Management of Change in Organization, Journal of Nigerian Academic Forum, Vol. 8 No. 3 May"
        },
        {
            "id": "16",
            "title": "Okoye, E. and Mbonu, C. (2005), Overview of Accounting in the Nigerian Petroleum (Upstream) Industry, Journal of Global Accounting, Vol.1 No. 2. September. "
        },
        {
            "id": "17",
            "title": "Okoye, E. and Okafor, B. E. (2005), The Qualitative Characteristics of Financial   Statements Audit in the Midst of Materiality Constraint, Journal of   Global Accounting. Vol. 1 No. 2, April."
        },
        {
            "id": "18",
            "title": "Okoye, E. (2005), Overcoming the Fear of the Rainy Day: A Look at the Available Viable Opportunities, Oko Journal of Business Studies, Vol. 4 No. 1, May. "
        },
        {
            "id": "19",
            "title": "Okoye, E. and Aroh, J.C. (2005), The Quest for Resource Control: A Challenge to Fiscal Federalism and Revenue Allocation in Nigeria, Oko Journal of Business Studies, Vol. 4 No. 1, May."
        },
        {
            "id": "20",
            "title": "Okoye. E. and Ubaka. E (2005), Towards a Model for Environment Cost Accounting: A Review for the Nigerian Corporate Profile, Oko Journal of Business Studies.  Vol. 4, No. 2."
        },
        {
            "id": "21",
            "title": "Okoye, E. and Ubaka, C.E. (2005), Ratio Analysis: A Sine Quo Non For Managerial Decision, The Journal of The Institute of Chartered Accountants of Nigeria. Vol. 38, No. 3."
        },
        {
            "id": "22",
            "title": "Okoye, E. (2005), The Role of Cost Control Strategies in Achieving Corporate  Survival and Growth in a Depressed Economy, Journal of Business Studies and Researc,. Vol. 2, No. 1, October."
        },
        {
            "id": "23",
            "title": "Okoye, E. (2005), Sources of Funding for Information Technology (IT) in Nigeria,  Journal of Marketing, Vol. 3. No.1, October."
        },
        {
            "id": "24",
            "title": "Okoye, E. and Ofoegbu G.N. (2005), Managing Cost of Quality In A Total  Quality Management (TQM) Environment, Journal of The Management  Sciences, Vol. 7 No. 1, July."
        }
    ]
}